Repository: hayfieldwind/beam-woocommerce-buy-subscription
Catalog: languages/beam-gateway-for-woocommerce-*.po
Languages: pt_pt

source: An error has occurred in the Beam Payment Gateway.
pt_pt: Ocorreu um erro na Gateway de Pagamentos Beam

source: Awaiting beam payment
pt_pt: A aguardar o pagamento com Beam

source: Beam Wallet
pt_pt: Carteira Beam

source: Beam Wallet Gateway
pt_pt: Gateway de Pagamento Beam

source: Beamer Email/Phone
pt_pt: Email/Telemóvel Beamer

source: Beamer PIN
pt_pt: PIN do Beamer

source: Check Terminal Credentials
pt_pt: Verificar credênciais do terminal

source: Checked
pt_pt: Verificado

source: Credentials Checked
pt_pt: Credênciais verificadas

source: Description
pt_pt: Descrição

source: Device ID
pt_pt: ID do dispositivo

source: Display Name
pt_pt: Nome a apresentar

source: Email/Phone
pt_pt: Email/Telemóvel

source: Enable Beam Wallet Gateway
pt_pt: Ativar a Gateway de Pagamentos Beam

source: Enable Logging?
pt_pt: Ativar o Log?

source: Enable Test Mode
pt_pt: Ativar Modo de Teste

source: Enable/Disable
pt_pt: Ativar/Desativar

source: Error in creating terminal conversation
pt_pt: Erro ao Iniciar Conversação do Terminal

source: Error in the Beamer Conversation
pt_pt: Erro ao Iniciar Conversação do Beamer

source: Error in the Beamer Login
pt_pt: Erro no Login do Beamer

source: Error in the Terminal Get Conversation
pt_pt: Erro ao Obter resultado da Conversação do Terminal

source: For monitoring purposes we will track all activities that occur and show them in the woocommerce status log
pt_pt: Apenas para monitorizar os pedidos efetuados serão armazenados registos nos logs do woocommerce

source: In test mode, you can use the following email "miguel@beamwallet.com" and pin "2580"
pt_pt: Em nodo Teste, poderá utilizar o email "miguel@beamwallet.com" com o pin "2580"

source: is required!
pt_pt: é obrigatório

source: Name
pt_pt: Nome

source: Pay with your Beam Wallet and earn rewards.
pt_pt: Pague com seu telefone, ganhe recompensas

source: Place the payment gateway in test mode using test API keys.
pt_pt: Coloque a Gateway de Pagamento em Modo de Teste

source: Take Beam Wallet payments on your store.
pt_pt: Leve os pagamentos com Beam até à sua loja online

source: Terminal Key
pt_pt: Chave do Terminal

source: Test mode
pt_pt: Modo de Teste

source: TEST MODE ENABLED
pt_pt: MODO DE TESTE ATIVADO

source: This controls the description which the user sees during checkout.
pt_pt: Esta opção controla a descrição que o utilizador vê quando está no ponto de Checkout

source: This controls the title which the user sees during checkout.
pt_pt: Esta opção controla o Título que o utilizador vê quando está no ponto de Checkout

source: Title
pt_pt: Título

source: WooCommerce Beam Payment Gateway
pt_pt: Gateway de Pagamentos Beam para o Woocommerce

source: If you dont have a beam wallet <a href="%s" target="_blank">click here</a> to create one now.
pt_pt: Se ainda não tem uma carteira beam <a href="%s" target="_blank">clique aqui</a> para criar agora uma nova.
